# Energy Analysis Space Get Closed Shell Method

Source: https://www.revitapidocs.com/2026/58410893-1269-98e3-7a07-e5dacafbc9fe.htm

---

| Energy Analysis Space Get Closed Shell Method |
| --- |

Gets the collection of polygons that form a closed shell.
 This method returns a collection of polyloops (planar
 polygons) that defines an enclosed volume measured by
 interior bounding surfaces, if in rooms and spaces mode.
 In other modes, returns no polyloops.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<Polyloop> GetClosedShell()
```

```
Public Function GetClosedShell As IList(Of Polyloop)
```

```
public:
IList<Polyloop^>^ GetClosedShell()
```

```
member GetClosedShell : unit -> IList<Polyloop>
```

#### Return Value

IList Polyloop
the collection of polygons that form a closed shell. See Also

#### Reference

EnergyAnalysisSpace Class Autodesk.Revit.DB.Analysis Namespace